# vectorized functions

In [ ]:
# Dot product 
import time 
import numpy 
import array 
  
# 8 bytes size int 
a = array.array('q') 
for i in range(100000): 
    a.append(i); 
  
b = array.array('q') 
for i in range(100000, 200000): 
    b.append(i) 
  
# classic dot product of vectors implementation  
tic = time.process_time() 
dot = 0.0; 
  
for i in range(len(a)): 
      dot += a[i] * b[i] 
  
toc = time.process_time() 
  
print("dot_product = "+ str(dot)); 
print("Computation time = " + str(1000*(toc - tic )) + "ms") 
   
  
n_tic = time.process_time() 
n_dot_product = numpy.dot(a, b) 
n_toc = time.process_time() 
  
print("\nn_dot_product = "+str(n_dot_product)) 
print("Computation time = "+str(1000*(n_toc - n_tic ))+"ms")

# Lamda

In [3]:
double = lambda x: x * 2

print(double(5))

10

# comprehensions

In [4]:
input_list = [1, 2, 3, 4, 4, 5, 6, 7, 7] 

list_using_comp = [var for var in input_list if var % 2 == 0] 
  
print("Output List using list comprehensions:", list_using_comp)

Output List using list comprehensions: [2, 4, 4, 6]

# negative indexing

In [5]:
l = [0,1,2,3,4,5]
l[-1]

5

In [6]:
l = [0,1,2,3,4,5]
l[-3:-1]

[3, 4]

# loc and iloc

In [7]:
# importing pandas and numpy
import pandas as pd
import numpy as np

# crete a sample dataframe
data = pd.DataFrame({
    'age' :     [ 10, 22, 13, 21, 12, 11, 17],
    'section' : [ 'A', 'B', 'C', 'B', 'B', 'A', 'A'],
    'city' :    [ 'Gurgaon', 'Delhi', 'Mumbai', 'Delhi', 'Mumbai', 'Delhi', 'Mumbai'],
    'gender' :  [ 'M', 'F', 'F', 'M', 'M', 'M', 'F'],
    'favourite_color' : [ 'red', np.NAN, 'yellow', np.NAN, 'black', 'green', 'red']
})

# view the data
data

   age section     city gender favourite_color
0   10       A  Gurgaon      M             red
1   22       B    Delhi      F             NaN
2   13       C   Mumbai      F          yellow
3   21       B    Delhi      M             NaN
4   12       B   Mumbai      M           black
5   11       A    Delhi      M           green
6   17       A   Mumbai      F             red

In [8]:
# select all rows with a condition
data.loc[data.age >= 15]

   age section    city gender favourite_color
1   22       B   Delhi      F             NaN
3   21       B   Delhi      M             NaN
6   17       A  Mumbai      F             red

In [9]:
# select with multiple conditions
data.loc[(data.age >= 12) & (data.gender == 'M')]

   age section    city gender favourite_color
3   21       B   Delhi      M             NaN
4   12       B  Mumbai      M           black

In [10]:
# select rows with indexes
data.iloc[[0,2]]

   age section     city gender favourite_color
0   10       A  Gurgaon      M             red
2   13       C   Mumbai      F          yellow

In [11]:
# select rows with particular indexes and particular columns
data.iloc[[0,2],[1,3]]

  section gender
0       A      M
2       C      F

In [12]:
# select a range of rows and columns
data.iloc[1:3,2:4]

     city gender
1   Delhi      F
2  Mumbai      F

# Pivot n group by

In [16]:
df = pd.DataFrame({"a": [1,2,3,1,2,3], "b":[1,1,1,2,2,2], "c":np.random.rand(6)})
pd.pivot_table(df, index=["a"], columns=["b"], values=["c"], aggfunc=np.sum)

          c
b         1         2
a
1  0.532679  0.690573
2  0.479103  0.731024
3  0.600794  0.341699

In [18]:
df.groupby(["a","b"]).sum()

            c
a b
1 1  0.532679
  2  0.690573
2 1  0.479103
  2  0.731024
3 1  0.600794
  2  0.341699

# Pandas to treat missing values

In [27]:
# importing pandas as pd 
import pandas as pd 
  
# importing numpy as np 
import numpy as np 
  
# dictionary of lists 
dict = {'First Score':[100, 90, np.nan, 95], 
        'Second Score': [30, 45, 56, np.nan], 
        'Third Score':[np.nan, 40, 80, 98]} 
  
# creating a dataframe from list 
df = pd.DataFrame(dict) 
  
# using isnull() function   
df.isnull()

   First Score  Second Score  Third Score
0        False         False         True
1        False         False        False
2         True         False        False
3        False          True        False

In [20]:
# using notnull() function  
df.notnull()

   First Score  Second Score  Third Score
0         True          True        False
1         True          True         True
2        False          True         True
3         True         False         True

In [21]:
# filling missing value using fillna()   
df.fillna(0)

   First Score  Second Score  Third Score
0        100.0          30.0          0.0
1         90.0          45.0         40.0
2          0.0          56.0         80.0
3         95.0           0.0         98.0

In [22]:
# filling a missing value with 
# previous ones   
df.fillna(method ='pad')

   First Score  Second Score  Third Score
0        100.0          30.0          NaN
1         90.0          45.0         40.0
2         90.0          56.0         80.0
3         95.0          56.0         98.0

In [23]:
# filling  null value using fillna() function   
df.fillna(method ='bfill')

   First Score  Second Score  Third Score
0        100.0          30.0         40.0
1         90.0          45.0         40.0
2         95.0          56.0         80.0
3         95.0           NaN         98.0

In [24]:
df["Second Score"].fillna("No Score", inplace = True)  
df

   First Score Second Score  Third Score
0        100.0           30          NaN
1         90.0           45         40.0
2          NaN           56         80.0
3         95.0     No Score         98.0

In [28]:
df.replace(to_replace = np.nan, value = -99)

   First Score  Second Score  Third Score
0        100.0          30.0        -99.0
1         90.0          45.0         40.0
2        -99.0          56.0         80.0
3         95.0         -99.0         98.0

In [29]:
df.interpolate(method ='linear', limit_direction ='forward')

   First Score  Second Score  Third Score
0        100.0          30.0          NaN
1         90.0          45.0         40.0
2         92.5          56.0         80.0
3         95.0          56.0         98.0

In [30]:
df.dropna()

   First Score  Second Score  Third Score
1         90.0          45.0         40.0

In [31]:
# importing pandas as pd 
import pandas as pd 
  
# importing numpy as np 
import numpy as np 
  
# dictionary of lists 
dict = {'First Score':[100, np.nan, np.nan, 95], 
        'Second Score': [30, np.nan, 45, 56], 
        'Third Score':[52, np.nan, 80, 98], 
        'Fourth Score':[np.nan, np.nan, np.nan, 65]} 
  
df = pd.DataFrame(dict) 
  
# using dropna() function     
df.dropna(how = 'all')

   First Score  Second Score  Third Score  Fourth Score
0        100.0          30.0         52.0           NaN
2          NaN          45.0         80.0           NaN
3         95.0          56.0         98.0          65.0

In [32]:
# importing pandas as pd 
import pandas as pd 
   
# importing numpy as np 
import numpy as np 
   
# dictionary of lists 
dict = {'First Score':[100, np.nan, np.nan, 95], 
        'Second Score': [30, np.nan, 45, 56], 
        'Third Score':[52, np.nan, 80, 98], 
        'Fourth Score':[60, 67, 68, 65]} 
  
# creating a dataframe from dictionary   
df = pd.DataFrame(dict) 
  
# using dropna() function      
df.dropna(axis = 1)

   Fourth Score
0            60
1            67
2            68
3            65